MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFM124/mcu.h
extern volatile __CNPDJbits_t CNPDJbits __asm__ ("CNPDJ") __attribute__((section("sfrs"), address(0xBF860860)));
extern volatile uint32_t        CNPDJCLR __attribute__((section("sfrs"),address(0xBF860864)));
extern volatile uint32_t        CNPDJSET __attribute__((section("sfrs"),address(0xBF860868)));
extern volatile uint32_t        CNPDJINV __attribute__((section("sfrs"),address(0xBF86086C)));
#define CNCONJ CNCONJ
extern volatile uint32_t   CNCONJ __attribute__((section("sfrs"), address(0xBF860870)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONJbits_t;
extern volatile __CNCONJbits_t CNCONJbits __asm__ ("CNCONJ") __attribute__((section("sfrs"), address(0xBF860870)));
extern volatile uint32_t        CNCONJCLR __attribute__((section("sfrs"),address(0xBF860874)));
extern volatile uint32_t        CNCONJSET __attribute__((section("sfrs"),address(0xBF860878)));
extern volatile uint32_t        CNCONJINV __attribute__((section("sfrs"),address(0xBF86087C)));
#define CNENJ CNENJ
extern volatile uint32_t   CNENJ __attribute__((section("sfrs"), address(0xBF860880)));
typedef union {
  struct {
    uint32_t CNIEJ0:1;
    uint32_t CNIEJ1:1;
    uint32_t CNIEJ2:1;
    uint32_t :1;
    uint32_t CNIEJ4:1;
    uint32_t :3;
    uint32_t CNIEJ8:1;
    uint32_t CNIEJ9:1;
    uint32_t :1;
    uint32_t CNIEJ11:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENJbits_t;
extern volatile __CNENJbits_t CNENJbits __asm__ ("CNENJ") __attribute__((section("sfrs"), address(0xBF860880)));
extern volatile uint32_t        CNENJCLR __attribute__((section("sfrs"),address(0xBF860884)));
extern volatile uint32_t        CNENJSET __attribute__((section("sfrs"),address(0xBF860888)));
extern volatile uint32_t        CNENJINV __attribute__((section("sfrs"),address(0xBF86088C)));
#define CNSTATJ CNSTATJ
extern volatile uint32_t   CNSTATJ __attribute__((section("sfrs"), address(0xBF860890)));
typedef union {
  struct {
    uint32_t CNSTATJ0:1;
    uint32_t CNSTATJ1:1;
    uint32_t CNSTATJ2:1;
    uint32_t CNSTATJ3:1;
    uint32_t :1;
    uint32_t CNSTATJ5:1;
    uint32_t :3;
    uint32_t CNSTATJ9:1;
    uint32_t :1;
    uint32_t CNSTATJ11:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATJbits_t;
extern volatile __CNSTATJbits_t CNSTATJbits __asm__ ("CNSTATJ") __attribute__((section("sfrs"), address(0xBF860890)));
extern volatile uint32_t        CNSTATJCLR __attribute__((section("sfrs"),address(0xBF860894)));
extern volatile uint32_t        CNSTATJSET __attribute__((section("sfrs"),address(0xBF860898)));
extern volatile uint32_t        CNSTATJINV __attribute__((section("sfrs"),address(0xBF86089C)));
#define CNNEJ CNNEJ
extern volatile uint32_t   CNNEJ __attribute__((section("sfrs"), address(0xBF8608A0)));
typedef struct {
  uint32_t CNNEJ0:1;
  uint32_t CNNEJ1:1;
  uint32_t CNNEJ2:1;
  uint32_t :1;
  uint32_t CNNEJ4:1;
  uint32_t :3;
  uint32_t CNNEJ8:1;
  uint32_t CNNEJ9:1;
  uint32_t :1;
  uint32_t CNNEJ11:1;
} __CNNEJbits_t;
extern volatile __CNNEJbits_t CNNEJbits __asm__ ("CNNEJ") __attribute__((section("sfrs"), address(0xBF8608A0)));
extern volatile uint32_t        CNNEJCLR __attribute__((section("sfrs"),address(0xBF8608A4)));
extern volatile uint32_t        CNNEJSET __attribute__((section("sfrs"),address(0xBF8608A8)));
extern volatile uint32_t        CNNEJINV __attribute__((section("sfrs"),address(0xBF8608AC)));
#define CNFJ CNFJ
extern volatile uint32_t   CNFJ __attribute__((section("sfrs"), address(0xBF8608B0)));
typedef struct {
  uint32_t CNFJ0:1;
  uint32_t CNFJ1:1;
  uint32_t CNFJ2:1;
  uint32_t :1;
  uint32_t CNFJ4:1;
  uint32_t :3;
  uint32_t CNFJ8:1;
  uint32_t CNFJ9:1;
  uint32_t :1;
  uint32_t CNFJ11:1;
} __CNFJbits_t;
extern volatile __CNFJbits_t CNFJbits __asm__ ("CNFJ") __attribute__((section("sfrs"), address(0xBF8608B0)));
extern volatile uint32_t        CNFJCLR __attribute__((section("sfrs"),address(0xBF8608B4)));
extern volatile uint32_t        CNFJSET __attribute__((section("sfrs"),address(0xBF8608B8)));
extern volatile uint32_t        CNFJINV __attribute__((section("sfrs"),address(0xBF8608BC)));
#define C1CON C1CON
extern volatile uint32_t   C1CON __attribute__((section("sfrs"), address(0xBF880000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t :6;
    uint32_t CANBUSY:1;
    uint32_t :1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :4;
    uint32_t CANCAP:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1CONbits_t;
extern volatile __C1CONbits_t C1CONbits __asm__ ("C1CON") __attribute__((section("sfrs"), address(0xBF880000)));
extern volatile uint32_t        C1CONCLR __attribute__((section("sfrs"),address(0xBF880004)));
extern volatile uint32_t        C1CONSET __attribute__((section("sfrs"),address(0xBF880008)));
extern volatile uint32_t        C1CONINV __attribute__((section("sfrs"),address(0xBF88000C)));
#define C1CFG C1CFG
extern volatile uint32_t   C1CFG __attribute__((section("sfrs"), address(0xBF880010)));
typedef union {
  struct {
    uint32_t BRP:6;
    uint32_t SJW:2;
    uint32_t PRSEG:3;
    uint32_t SEG1PH:3;
    uint32_t SAM:1;
    uint32_t SEG2PHTS:1;
    uint32_t SEG2PH:3;
    uint32_t :3;
    uint32_t WAKFIL:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1CFGbits_t;
extern volatile __C1CFGbits_t C1CFGbits __asm__ ("C1CFG") __attribute__((section("sfrs"), address(0xBF880010)));
extern volatile uint32_t        C1CFGCLR __attribute__((section("sfrs"),address(0xBF880014)));
extern volatile uint32_t        C1CFGSET __attribute__((section("sfrs"),address(0xBF880018)));
extern volatile uint32_t        C1CFGINV __attribute__((section("sfrs"),address(0xBF88001C)));
#define C1INT C1INT
extern volatile uint32_t   C1INT __attribute__((section("sfrs"), address(0xBF880020)));
typedef union {
  struct {
    uint32_t TBIF:1;
    uint32_t RBIF:1;
    uint32_t CTMRIF:1;
    uint32_t MODIF:1;
    uint32_t :7;
    uint32_t RBOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVRIF:1;
    uint32_t TBIE:1;
    uint32_t RBIE:1;
    uint32_t CTMRIE:1;
    uint32_t MODIE:1;
    uint32_t :7;
    uint32_t RBOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVRIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1INTbits_t;
extern volatile __C1INTbits_t C1INTbits __asm__ ("C1INT") __attribute__((section("sfrs"), address(0xBF880020)));
extern volatile uint32_t        C1INTCLR __attribute__((section("sfrs"),address(0xBF880024)));
extern volatile uint32_t        C1INTSET __attribute__((section("sfrs"),address(0xBF880028)));
extern volatile uint32_t        C1INTINV __attribute__((section("sfrs"),address(0xBF88002C)));
#define C1VEC C1VEC
extern volatile uint32_t   C1VEC __attribute__((section("sfrs"), address(0xBF880030)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1VECbits_t;
extern volatile __C1VECbits_t C1VECbits __asm__ ("C1VEC") __attribute__((section("sfrs"), address(0xBF880030)));
extern volatile uint32_t        C1VECCLR __attribute__((section("sfrs"),address(0xBF880034)));
extern volatile uint32_t        C1VECSET __attribute__((section("sfrs"),address(0xBF880038)));
extern volatile uint32_t        C1VECINV __attribute__((section("sfrs"),address(0xBF88003C)));
#define C1TREC C1TREC
extern volatile uint32_t   C1TREC __attribute__((section("sfrs"), address(0xBF880040)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1TRECbits_t;
extern volatile __C1TRECbits_t C1TRECbits __asm__ ("C1TREC") __attribute__((section("sfrs"), address(0xBF880040)));
extern volatile uint32_t        C1TRECCLR __attribute__((section("sfrs"),address(0xBF880044)));
extern volatile uint32_t        C1TRECSET __attribute__((section("sfrs"),address(0xBF880048)));
extern volatile uint32_t        C1TRECINV __attribute__((section("sfrs"),address(0xBF88004C)));
#define C1FSTAT C1FSTAT
extern volatile uint32_t   C1FSTAT __attribute__((section("sfrs"), address(0xBF880050)));
typedef union {
  struct {
    uint32_t FIFOIP:32;
  };
  struct {
    uint32_t FIFOIP0:1;
    uint32_t FIFOIP1:1;
    uint32_t FIFOIP2:1;
    uint32_t FIFOIP3:1;
    uint32_t FIFOIP4:1;
    uint32_t FIFOIP5:1;
    uint32_t FIFOIP6:1;
    uint32_t FIFOIP7:1;
    uint32_t FIFOIP8:1;
    uint32_t FIFOIP9:1;
    uint32_t FIFOIP10:1;
    uint32_t FIFOIP11:1;
    uint32_t FIFOIP12:1;
    uint32_t FIFOIP13:1;
    uint32_t FIFOIP14:1;
    uint32_t FIFOIP15:1;
    uint32_t FIFOIP16:1;
    uint32_t FIFOIP17:1;
    uint32_t FIFOIP18:1;
    uint32_t FIFOIP19:1;
    uint32_t FIFOIP20:1;
    uint32_t FIFOIP21:1;
    uint32_t FIFOIP22:1;
    uint32_t FIFOIP23:1;
    uint32_t FIFOIP24:1;
    uint32_t FIFOIP25:1;
    uint32_t FIFOIP26:1;
    uint32_t FIFOIP27:1;
    uint32_t FIFOIP28:1;
    uint32_t FIFOIP29:1;
    uint32_t FIFOIP30:1;
    uint32_t FIFOIP31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FSTATbits_t;
extern volatile __C1FSTATbits_t C1FSTATbits __asm__ ("C1FSTAT") __attribute__((section("sfrs"), address(0xBF880050)));
extern volatile uint32_t        C1FSTATCLR __attribute__((section("sfrs"),address(0xBF880054)));
extern volatile uint32_t        C1FSTATSET __attribute__((section("sfrs"),address(0xBF880058)));
extern volatile uint32_t        C1FSTATINV __attribute__((section("sfrs"),address(0xBF88005C)));
#define C1RXOVF C1RXOVF
extern volatile uint32_t   C1RXOVF __attribute__((section("sfrs"), address(0xBF880060)));
typedef union {
  struct {
    uint32_t RXOVF:32;
  };
  struct {
    uint32_t RXOVF0:1;
    uint32_t RXOVF1:1;
    uint32_t RXOVF2:1;
    uint32_t RXOVF3:1;
    uint32_t RXOVF4:1;
    uint32_t RXOVF5:1;
    uint32_t RXOVF6:1;
    uint32_t RXOVF7:1;
    uint32_t RXOVF8:1;
    uint32_t RXOVF9:1;
    uint32_t RXOVF10:1;
    uint32_t RXOVF11:1;
    uint32_t RXOVF12:1;
    uint32_t RXOVF13:1;
    uint32_t RXOVF14:1;
    uint32_t RXOVF15:1;
    uint32_t RXOVF16:1;
    uint32_t RXOVF17:1;
    uint32_t RXOVF18:1;
    uint32_t RXOVF19:1;
    uint32_t RXOVF20:1;
    uint32_t RXOVF21:1;
    uint32_t RXOVF22:1;
    uint32_t RXOVF23:1;
    uint32_t RXOVF24:1;
    uint32_t RXOVF25:1;
    uint32_t RXOVF26:1;
    uint32_t RXOVF27:1;
    uint32_t RXOVF28:1;
    uint32_t RXOVF29:1;
    uint32_t RXOVF30:1;
    uint32_t RXOVF31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXOVFbits_t;
extern volatile __C1RXOVFbits_t C1RXOVFbits __asm__ ("C1RXOVF") __attribute__((section("sfrs"), address(0xBF880060)));
extern volatile uint32_t        C1RXOVFCLR __attribute__((section("sfrs"),address(0xBF880064)));
extern volatile uint32_t        C1RXOVFSET __attribute__((section("sfrs"),address(0xBF880068)));
extern volatile uint32_t        C1RXOVFINV __attribute__((section("sfrs"),address(0xBF88006C)));
#define C1TMR C1TMR
extern volatile uint32_t   C1TMR __attribute__((section("sfrs"), address(0xBF880070)));
typedef union {
  struct {
    uint32_t CANTSPRE:16;
    uint32_t CANTS:16;
  };
  struct {
    uint32_t w:32;
  };
} __C1TMRbits_t;
extern volatile __C1TMRbits_t C1TMRbits __asm__ ("C1TMR") __attribute__((section("sfrs"), address(0xBF880070)));
extern volatile uint32_t        C1TMRCLR __attribute__((section("sfrs"),address(0xBF880074)));
extern volatile uint32_t        C1TMRSET __attribute__((section("sfrs"),address(0xBF880078)));
extern volatile uint32_t        C1TMRINV __attribute__((section("sfrs"),address(0xBF88007C)));
#define C1RXM0 C1RXM0
extern volatile uint32_t   C1RXM0 __attribute__((section("sfrs"), address(0xBF880080)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXM0bits_t;
extern volatile __C1RXM0bits_t C1RXM0bits __asm__ ("C1RXM0") __attribute__((section("sfrs"), address(0xBF880080)));
extern volatile uint32_t        C1RXM0CLR __attribute__((section("sfrs"),address(0xBF880084)));
extern volatile uint32_t        C1RXM0SET __attribute__((section("sfrs"),address(0xBF880088)));
extern volatile uint32_t        C1RXM0INV __attribute__((section("sfrs"),address(0xBF88008C)));
#define C1RXM1 C1RXM1
extern volatile uint32_t   C1RXM1 __attribute__((section("sfrs"), address(0xBF880090)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXM1bits_t;
extern volatile __C1RXM1bits_t C1RXM1bits __asm__ ("C1RXM1") __attribute__((section("sfrs"), address(0xBF880090)));
extern volatile uint32_t        C1RXM1CLR __attribute__((section("sfrs"),address(0xBF880094)));
extern volatile uint32_t        C1RXM1SET __attribute__((section("sfrs"),address(0xBF880098)));
extern volatile uint32_t        C1RXM1INV __attribute__((section("sfrs"),address(0xBF88009C)));
#define C1RXM2 C1RXM2
extern volatile uint32_t   C1RXM2 __attribute__((section("sfrs"), address(0xBF8800A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t MIDE:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXM2bits_t;
